"""
Задача 1: Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
"""
variable_int = int(input('Введите целое число: '))
variable_str = input('Введите любое слово: ')
variable_float = float(input('Введите дробное число в формате "2.1": '))

print('Вы ввели: ', variable_int, variable_str, variable_float)
